Процедура ОтправитьСостояниеВМониторингПослеОбменаДанными(СтруктураНастроекОбмена) Экспорт
	
	ПрефиксИБ = ОбменДаннымиСервер.ПрефиксИнформационнойБазы();
	
	Если СтруктураНастроекОбмена.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ЗагрузкаДанных Тогда
		Действие = "Загрузка";
	Иначе
		Действие = "Выгрузка";
	КонецЕсли;
	
	ИмяЭлементаДанных = ZabbixМониторинг.ЭлементДанныхДляОтправкиСостоянияОбменаЧерезКонвертацию(ПрефиксИБ,
		Строка(СтруктураНастроекОбмена.УзелИнформационнойБазы.УникальныйИдентификатор()),
		Действие);
		
	Мониторинг = ZabbixМониторинг.ПолучитьZabbixМониторинг(ИмяЭлементаДанных);
	
	РезультатВыполненияОбмена = РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена);

	Если РезультатВыполненияОбмена Тогда
		Мониторинг.ОтправитьСостояниеУспех();		
	Иначе
		Мониторинг.ОтправитьСостояниеСбой();					
	КонецЕсли;
	
КонецПроцедуры
 
Функция РезультатВыполненияОбменаВыполнено(РезультатВыполненияОбмена)
	
	Возврат РезультатВыполненияОбмена = Неопределено
		ИЛИ РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено
		ИЛИ РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями;
	
КонецФункции
