
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.ZabbixPassiveItems.ЗначенияПеречисления Цикл
		НоваяСтрока = ИменаПассивныхЭлементовДанныхZabbix.Добавить();
		НоваяСтрока.Key = ЗначениеПеречисления.Имя;
		НоваяСтрока.Name = ЗначениеПеречисления.Синоним;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестУспехНаСервере(ЭлементДанных, РежимЭмуляции)
	
	Мониторинг = ZabbixМониторинг.ПолучитьZabbixМониторинг(ЭлементДанных);
	
	Если РежимЭмуляции Тогда
		Мониторинг.ВключитьРежимЭмуляции();	
	КонецЕсли; 
	
	Мониторинг.ОтправитьСостояниеУспех();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестУспех(Команда)
	
	ТекущиеДанные = Элементы.ИменаПассивныхЭлементовДанныхZabbix.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТестУспехНаСервере(ТекущиеДанные.Key, РежимЭмуляции);
	Иначе
		ПоказатьПредупреждение(, "Необходимо выбрать элемент данных для тестирования!");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестСбойНаСервере(ЭлементДанных, РежимЭмуляции)
	
	Мониторинг = ZabbixМониторинг.ПолучитьZabbixМониторинг(ЭлементДанных);
	
	Если РежимЭмуляции Тогда
		Мониторинг.ВключитьРежимЭмуляции();	
	КонецЕсли; 

	Мониторинг.ОтправитьСостояниеСбой();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСбой(Команда)
	
	ТекущиеДанные = Элементы.ИменаПассивныхЭлементовДанныхZabbix.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТестСбойНаСервере(ТекущиеДанные.Key, РежимЭмуляции);
	Иначе
		ПоказатьПредупреждение(, "Необходимо выбрать элемент данных для тестирования!");		
	КонецЕсли;
	
КонецПроцедуры
