//заглушка
//не переносить в конфигурацию, только для примера доработки типовой функции

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
//
////////////////////////////////////////////////////////////////////////////////

// Регистрирует что обмен был произведен и фиксирует информацию в протоколе.
//
// Параметры:
//  СтруктураНастроекОбмена - Структура - структура со всеми необходимыми данными и объектами для выполнения обмена.
// 
Процедура ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена) Экспорт
	
	//// Статус "Неопределено" в конце обмена свидетельствует об успешном выполнении обмена.
	//Если СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено Тогда
	//	СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено;
	//КонецЕсли;
	//
	//// Формируем итоговое сообщение для протокола.
	//Если СтруктураНастроекОбмена.ЭтоОбменВРИБ Тогда
	//	СтрокаСообщения = НСтр("ru = '%1, %2'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	//	СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
	//						СтруктураНастроекОбмена.РезультатВыполненияОбмена,
	//						СтруктураНастроекОбмена.ДействиеПриОбмене);
	//Иначе
	//	СтрокаСообщения = НСтр("ru = '%1, %2; Объектов обработано: %3'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	//	СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
	//						СтруктураНастроекОбмена.РезультатВыполненияОбмена,
	//						СтруктураНастроекОбмена.ДействиеПриОбмене,
	//						СтруктураНастроекОбмена.КоличествоОбъектовОбработано);
	//КонецЕсли;
	//
	//СтруктураНастроекОбмена.ДатаОкончания = ТекущаяДатаСеанса();
	
	//// Фиксируем состояние обмена в РС.
	//ЗафиксироватьЗавершениеОбменаВРегистреСведений(СтруктураНастроекОбмена);
	
	//выше код из типовой
	//Вставить вызов
	Zabbix_ОбменДаннымиСервер.ОтправитьСостояниеВМониторингПослеОбменаДанными(СтруктураНастроекОбмена);
	//конец вставки
	//ниже код из типовой
	
	//// Если обмен данными был успешно выполнен.
	//Если РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
	//	
	//	ЗафиксироватьУспешныйОбменДаннымиВРегистреСведений(СтруктураНастроекОбмена);
	//	
	//	РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.СнятьПризнакОтправкиДанных(СтруктураНастроекОбмена.УзелИнформационнойБазы);
	//	
	//КонецЕсли;
	//
	//ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
	
КонецПроцедуры

